using System;

/*
 * LAB1
Написати програму, що виконує наступні функції 
    1. Виводить на екран введене число з клавіатури в зворотному порядку (1234->4321)
    2. Виводить будь-яку строку в зворотному порядку (АБВ->ВБА)
    3. Дробові числа виводяться в зворотному порядку і ціла частина і дробова (123.456->321.654)
    4. Реалізувати метод, що буде масив повертати задом навпаки (Використання Array.Reverse() заборонено!)
    5. Виконати пункт 4 з використанням ключових слів ref i out
*/

namespace work_6
{
    class Program
    {
        static void Main(string[] args)
        {
            MyReverse obj = new MyReverse();
            // Console.WriteLine(obj.Rev(123));
            int[] n = { 2, 1, 3, 4, 5 };
            Console.WriteLine(obj.Max(n));
            Console.ReadLine();
        }
    }
}
